sandboxでのapply結果

```hcl
❯ aws-vault exec (awsp) -- terraform apply
module.example.data.aws_caller_identity.self: Reading...
module.example.data.aws_caller_identity.self: Read complete after 0s [id=477235943564]

Terraform used the selected providers to generate the following
execution plan. Resource actions are indicated with the following
symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.example.data.aws_iam_policy_document.github_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_actions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:torana-us/terraform-modules:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.example.aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.example.module.github_actions_role.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]
    }

  # module.example.module.github_actions_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
      + max_session_duration  = 3600
      + name                  = "github_actions_role_example"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "github_actions_role_example"
        }
      + tags_all              = {
          + "Name" = "github_actions_role_example"
        }
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.example.aws_iam_openid_connect_provider.this: Creating...
module.example.aws_iam_openid_connect_provider.this: Creation complete after 1s [id=arn:aws:iam::477235943564:oidc-provider/token.actions.githubusercontent.com]
module.example.data.aws_iam_policy_document.github_actions: Reading...
module.example.data.aws_iam_policy_document.github_actions: Read complete after 0s [id=3505063397]
module.example.module.github_actions_role.data.aws_iam_policy_document.base: Reading...
module.example.module.github_actions_role.data.aws_iam_policy_document.base: Read complete after 0s [id=3505063397]
module.example.module.github_actions_role.aws_iam_role.this: Creating...
module.example.module.github_actions_role.aws_iam_role.this: Creation complete after 2s [id=github_actions_role_example]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```